Radiacion/Case-ViewFactor-Ra30000-test4/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 303;

boundaryField
{
    frontAndBack
    {
        type        empty;
    }

    right
    {
	 type           externalWallHeatFluxTemperature;
	 mode 		flux; //coeficient
	 q		uniform 0;
	 qr		qr;
	 value		$internalField;
	 kappaMethod	fluidThermo;
          
    }
 
    left
    {
	 type           externalWallHeatFluxTemperature;
	 mode 		flux; //coeficient
	 q		uniform 0;
	 qr		qr;
	 value		$internalField;
	 kappaMethod	fluidThermo;
                
    }

   cold
    {
        type            fixedValue;
        value           uniform 303;
    }

    hot
    {
        type            fixedValue;
        value           uniform 315;  
    }
}


// ************************************************************************* //
