Radiacion/Case-ViewFactor-Ra30000-test4/0/viewFactorField
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      viewFactorField;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    cold
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.953475
0.953475
0.984355
0.984355
0.98772
0.98772
0.98936
0.98936
...
)
;
    }
    hot
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.953475
0.953475
0.984355
0.984355
0.98772
0.98772
0.98936
0.98936
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.953475
0.953475
0.984355
0.984355
0.98772
0.98772
0.98936
0.98936
...
)
;
    }
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.953475
0.953475
0.984355
0.984355
0.98772
0.98772
0.98936
0.98936
...
)
;
    }
}


// ************************************************************************* //
